ox_docs/corners/david/magnetism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-27 Mon 11:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Magnetism</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Magnetism</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-09-27 Mon 11:51</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='phys-index.html'>PHYS250 Index</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org1b49350">1. Intro Magnetism</a>
<ul>
<li><a href="#orgc95f85b">1.1. Fields</a></li>
<li><a href="#org53aceb6">1.2. Cross Product Notes</a></li>
</ul>
</li>
<li><a href="#org28f3b24">2. Right Hand Rules</a>
<ul>
<li><a href="#org0f60372">2.1. Right Hand Rule 1</a></li>
<li><a href="#orgc7b21c1">2.2. Right Hand Rule 1.5</a></li>
<li><a href="#orga1001ea">2.3. Right Hand Rule 2</a></li>
</ul>
</li>
<li><a href="#orga982635">3. Field Equations</a></li>
<li><a href="#orgf4fc8a9">4. Motors</a></li>
<li><a href="#orgba3e50b">5. Circular Motion</a></li>
<li><a href="#org54ebe7c">6. Induction</a></li>
<li><a href="#org1c5b559">7. Flux and EMF</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-org1b49350" class="outline-2">
<h2 id="org1b49350"><span class="section-number-2">1</span> Intro Magnetism</h2>
<div class="outline-text-2" id="text-1">
<p>
There is no such thing as a monopole, as splitting up a magnet into two pieces just gives you two smaller magnets.
</p>
</div>

<div id="outline-container-orgc95f85b" class="outline-3">
<h3 id="orgc95f85b"><span class="section-number-3">1.1</span> Fields</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Magnetic field lines point to the direction of magnetic north at each point.
</p>

<p>
Magnetic fields are created by moving charges (like a current in a wire), and in the case of a straight current-carrying wire the magnetic field is a series of circles with increasing radius wrapping around it (encircling it). Because of this, magnetic fields are inherently
three-dimensional in their representation.
</p>

<p>
The convention for depicting three-dimensional fields is as follows:
</p>
<ul class="org-ul">
<li>\(\bigodot\) for arrows going out of the page (tip of the arrow facing you)</li>
<li>\(\bigotimes\) for arrows going into the page (tail of the arrow facing you)</li>
</ul>

<p>
A current-carrying loop of wire produces the same series of circles for each point (imagine twisting the straight wire), all of which have the largest radius as the approach the center of the loop and the field line becomes nearly straight.
</p>


<p>
Charge moving through a magnetic field feels a force that is the cross product of its velocity and the field lines (perpendicular to both forming a right angle): its direction can be decided by Right Hand Rule 2.
</p>
</div>
</div>

<div id="outline-container-org53aceb6" class="outline-3">
<h3 id="org53aceb6"><span class="section-number-3">1.2</span> Cross Product Notes</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Right hand rule 2 only for positive charges</li>
<li>Perpendicular force causes circular motion
<ul class="org-ul">
<li>In a field pointed into the page and a particle travelling right, there is a force exerted downward. As the particle moves because of its velocity, the force's direction and magnitude change to continue to be perpendicular to it. A consistent perpendicular force inwards is circular motion (as we know from PHYS101)</li>
</ul></li>
<li>When direction of velocity equals direction of magnetic field there's no force (intuitive reason: there's no way to do that with the right hand rule)</li>
<li>Cross product is used to calculate force</li>
<li>\(F = q\mathbf{V} \times \mathbf{B}\)
<ul class="org-ul">
<li>This means direction is determined through right hand rule</li>
<li>Magnitude is just \(F = qVB\sin{\theta}\)</li>
</ul></li>
<li>Earth has a magnetic field
<ul class="org-ul">
<li>Charged particles enter earths field and make circles around field lines (as lines converge the spiral becomes tighter).</li>
</ul></li>
</ul>

<p>
Electron is travelling at 2km/s to the right in a 50µT field which is directed upwards. Magnitude of the force = \(-1.602 * 10^{-19} * 2000 * 50 * 10^{-6} * \sin{90\degrees}\)
</p>


<ul class="org-ul">
<li>For a wire we need to consider the amount of the wire inside the field to get force (we need length \(L\)).
<ul class="org-ul">
<li>A wire is just a tube of electrons so \(F=Q_{\text{total}} B V\). \(Q_{\text{total}}=nALq\)</li>
<li>this cancels to \(Q_{\text{total}}=ILB\) since multiplying density of charge times area times the velocity yields current (since current is a measure of how much charge is flowing past a certain point per second).</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org28f3b24" class="outline-2">
<h2 id="org28f3b24"><span class="section-number-2">2</span> Right Hand Rules</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0f60372" class="outline-3">
<h3 id="org0f60372"><span class="section-number-3">2.1</span> Right Hand Rule 1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Hold your right hand out in a thumbs up motion, where the thumb points in the direction of current. Your curled up fingers follow the direction of the magnetic field encircling the wire.
</p>
</div>
</div>

<div id="outline-container-orgc7b21c1" class="outline-3">
<h3 id="orgc7b21c1"><span class="section-number-3">2.2</span> Right Hand Rule 1.5</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Thumbs up motion, where the curled up fingers follow the direction of the wire's current. Your thumb points in the direction of the magnetic field lines going outwards (do not that there are loops of field lines that close up farther from the center too).
</p>
</div>
</div>

<div id="outline-container-orga1001ea" class="outline-3">
<h3 id="orga1001ea"><span class="section-number-3">2.3</span> Right Hand Rule 2</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Thumb is current, fingers are a magnetic field and the palm is the force experienced. AKA cross product.
Coil:
</p>
</div>
</div>
</div>
<div id="outline-container-orga982635" class="outline-2">
<h2 id="orga982635"><span class="section-number-2">3</span> Field Equations</h2>
<div class="outline-text-2" id="text-3">
<p>
Note that \(\mu_0 = 4\pi * 10^7\). N refers to number of loops throughout.
</p>

<ul class="org-ul">
<li>Straight portion of wire: \(B = \frac{\mu_0 I}{2\pi r} N\) where r is dist from wire</li>
<li>Loops: \(B = \frac{\mu_0 I R^2}{2(d^2 + R^2)^{3/2}}N\) where R is radius of loop and d is dist from loop center</li>
<li>Long solenoid approximation (idealized, only use when length is much more than loop radus): \(B\approx \mu_0 \frac{N}{L} I\) where L is length of solenoid.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf4fc8a9" class="outline-2">
<h2 id="orgf4fc8a9"><span class="section-number-2">4</span> Motors</h2>
</div>

<div id="outline-container-orgba3e50b" class="outline-2">
<h2 id="orgba3e50b"><span class="section-number-2">5</span> Circular Motion</h2>
</div>

<div id="outline-container-org54ebe7c" class="outline-2">
<h2 id="org54ebe7c"><span class="section-number-2">6</span> Induction</h2>
<div class="outline-text-2" id="text-6">
<p>
It's all just RHR 2: do consider that mechanical movement is movement of charge and therefore acts as current.
</p>

<p>
Ex 1: current flowing through a loop induces movement by RHR 2 because
</p>
</div>
</div>

<div id="outline-container-org1c5b559" class="outline-2">
<h2 id="org1c5b559"><span class="section-number-2">7</span> Flux and EMF</h2>
<div class="outline-text-2" id="text-7">
<p>
Flux through a surface is \(BA\), aka field times area. If there are loops, multiply this by \(N\). If the surface is tilted relative to the field lines the equation \(BA\cos{\theta}\) applies.
</p>

<p>
EMF is given by rate of change in flux (\(-\frac{d\Phi}{dt}\)), aka Flux per second. Since Flux is in units of Volt-seconds this means that EMF is just Volts.
</p>


<ol class="org-ol">
<li>As flux is \(BA\), flux increases.</li>
<li>The corresponding EMF is in the opposite direction (\(-\frac{d\Phi}{dt}\))</li>
<li>EMF is electromotive force, so true to its name it creates current in the opposite direction</li>
<li>This current induces a downward pointing field opposing the flux change</li>
</ol>
</div>
</div>
</div>
</body>
</html>
